app/controllers/posts_controller.rb

  def landing_page
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
    puts post_params
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("posts_content", "art_title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["posts_content", "Yerevan"], ["art_title", "Cascade"], ["user_id", 3], ["created_at", "2019-12-27 12:25:01.497392"], ["updated_at", "2019-12-27 12:25:01.497392"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "posts_content" = ?, "art_title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["posts_content", "Test"], ["art_title", "Cascade Hills"], ["updated_at", "2019-12-25 12:38:13.389787"], ["id", 23]]